type Theme = [string, string, string] // [dateRange, startEmoji, endEmoji]

const THEMES: readonly Theme[] = [
  // Annually recurring (MM-DD)
  ['01-01_01-05', '🎉', '🪩'], // New Year's Day
  ['02-14', '🌹', '🥀'], // Valentine's Day
  ['03-01', '🌼', '🌱'], // Spring Begins (Northern Hemisphere)
  ['03-14', '🥧', '🍽️'], // Pi Day
  ['03-17', '🍀', '⬜️'], // St Patrick's Day (Ireland)
  ['04-01', '🃏', '🕳️'], // April Fool's Day
  ['04-22', '🌎', '⬜️'], // Earth Day
  ['05-04', '⭐️', '🌌'], // Star Wars Day
  ['05-20', '🐝', '🌸'], // World Bee Day
  ['05-30', '🥔', '⬜️'], // International Day of Potato
  ['06-01', '☀️', '🌤️'], // Summer Begins (Northern Hemisphere)
  ['06-03', '🚲', '⬜️'], // World Bicycle Day
  ['06-05', '🌳', '⬜️'], // World Environment Day
  ['06-08', '🌊', '⬜️'], // World Oceans Day
  ['06-19_06-23', '☀️', '☁️'], // Summer Solstice (21st June)
  ['07-04', '🎆', '⬛️'], // Independence Day (US)
  ['07-20', '🌝', '🌚'], // International Moon Day
  ['09-01', '🍂', '🍃'], // Autumn Begins (Northern Hemisphere)
  ['09-05', '💖', '🤍'], // International Charity Day
  ['09-21', '☮️', '⬛️'], // International Day of Peace
  ['10-01', '☕️', '🕘'], // International Coffee Day
  ['10-24_10-31', '🎃', '🦇'], // Halloween
  ['12-01_12-31', '⛄️', '🧊'], // Winter (Northern Hemisphere)

  // Chinese New Year
  ['02-17-2026', '🐴', '🧧'],
  ['02-06-2027', '🐐', '🧧'],
  ['01-26-2028', '🐒', '🧧'],
  ['02-13-2029', '🐓', '🧧'],
  ['02-03-2030', '🐶', '🧧'],
  ['01-23-2031', '🐷', '🧧'],
  ['02-11-2032', '🐀', '🧧'],
  ['01-31-2033', '🐂', '🧧'],
  ['02-19-2034', '🐯', '🧧'],
  ['02-08-2035', '🐰', '🧧'],

  // Easter
  ['03-26-2026_04-05-2026', '🐣', '🥚'],
  ['03-18-2027_03-28-2027', '🐣', '🥚'],
  ['04-06-2028_04-16-2028', '🐣', '🥚'],
  ['03-22-2029_04-01-2029', '🐣', '🥚'],
  ['04-11-2030_04-21-2030', '🐣', '🥚'],

  // Pancake Day
  ['02-17-2026', '🥞', '🍽️'],
  ['02-09-2027', '🥞', '🍽️'],
  ['02-29-2028', '🥞', '🍽️'],
  ['02-13-2029', '🥞', '🍽️'],
  ['03-05-2030', '🥞', '🍽️'],

  // Thanksgiving (US)
  ['11-25-2026_11-26-2026', '🦃', '🍂'],
  ['11-24-2027_11-25-2027', '🦃', '🍂'],
  ['11-22-2028_11-23-2028', '🦃', '🍂'],
  ['11-21-2029_11-22-2029', '🦃', '🍂'],
  ['11-27-2030_11-28-2030', '🦃', '🍂'],

  // Wimbledon (UK)
  ['06-29-2026_07-12-2026', '🎾', '⬛️'],
  ['06-28-2027_07-11-2027', '🎾', '⬛️'],
] as const

export {
  THEMES,
}
